
/* 1 Пусть задан некоторый пользователь. Из всех пользователей соц. сети найдите человека, 
который больше всех общался с выбранным пользователем (написал ему сообщений).*/

SELECT from_user_id, COUNT(*) as best_friend
FROM messages 
WHERE to_user_id=1 -- получатель сообщений выбранный нами по условию задания
GROUP BY from_user_id
ORDER BY best_friend DESC; -- сортировка друзей начиная с пользователя приславшего наибольшее количество сообщений


-- 2 Подсчитать общее количество лайков, которые получили пользователи младше 10 лет

SELECT COUNT(*) as 'Likes'
FROM profiles 
WHERE (YEAR(NOW())-YEAR(birthday)) < 10;

-- пересоздана и заполнена таблица profiles с учетом колонок города и пола

DROP TABLE IF EXISTS `profiles`;
CREATE TABLE `profiles` (
	user_id BIGINT UNSIGNED NOT NULL UNIQUE,
    gender CHAR(1),
    birthday DATE,
	photo_id BIGINT UNSIGNED NULL,
    created_at DATETIME DEFAULT NOW(),
    hometown VARCHAR(100),
    is_active BIT DEFAULT TRUE NULL,
    FOREIGN KEY (user_id) REFERENCES users(id) ON UPDATE CASCADE ON DELETE restrict,
    FOREIGN KEY (photo_id) REFERENCES media(id)
);
INSERT INTO `profiles` VALUES 
('1','f','1976-11-08','1','1970-01-18 03:54:01','Воронеж',''),
('2','f','2011-12-20','2','1994-11-06 23:56:10','Ковров',''),
('3','m','1994-06-15','3','1975-11-27 02:27:11','Калинов',''),
('4','f','1979-11-07','4','1994-04-12 04:31:49','Санкт-Петербург',''),
('5','f','1976-04-19','5','1976-07-05 02:25:30','Калинов',''),
('6','f','1983-09-07','6','1981-06-20 15:54:43','Санкт-Петербург',''),
('7','m','2014-07-31','7','1997-06-21 07:52:05','Калинов',''),
('8','f','1975-03-26','8','2008-08-18 18:23:25','Санкт-Петербург',''),
('9','f','1982-11-01','9','2014-09-29 01:22:26','Санкт-Петербург',''),
('10','m','1977-05-14','10','1980-03-17 18:17:45','Ростов',''),
('11','m','1988-10-28','11','2011-08-22 08:31:06','Ростов',''),
('12','f','1994-02-07','12','2015-08-04 16:34:50','Москва',''),
('13','f','1998-08-08','13','1978-02-12 03:14:55','Ростов',''),
('14','f','1973-11-16','14','2015-03-13 03:01:16','Ростов',''),
('15','m','1979-08-20','15','1983-08-13 03:48:56','Москва',''),
('16','m','1997-03-17','16','1989-09-08 23:17:00','Москва',''),
('17','m','2015-02-25','17','1992-10-29 05:38:24','Москва',''),
('18','f','2011-04-05','18','1981-08-22 06:53:53','Пенза',''),
('19','f','1981-01-24','19','1975-08-17 04:48:38','Пенза',''),
('20','f','2010-03-12','20','2008-02-11 09:39:28','Пенза','');

-- 3 Определить кто больше поставил лайков (всего): мужчины или женщины.

SELECT COUNT(*) AS likes, gender FROM likes, profiles
WHERE likes.user_id = profiles.user_id
GROUP BY gender;